In [1]:
import pandas as pd
obj = pd.Series([4,7,3,1])
obj

0    4
1    7
2    3
3    1
dtype: int64

In [2]:
obj.values

array([4, 7, 3, 1], dtype=int64)

In [3]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
obj = pd.Series([1,3,5,7], index=[2,4,6,8])
obj

2    1
4    3
6    5
8    7
dtype: int64

In [5]:
obj.values

array([1, 3, 5, 7], dtype=int64)

In [6]:
obj.index

Index([2, 4, 6, 8], dtype='int64')

In [7]:
data = {
    "Year": [2003, 2010, 2004, 2006, 2005],
    "Name": ["Tom", "Jerry", "John", "Peter", "Linda"],
    "Age": [21, 15, 20, 18, 19],
}
df = pd.DataFrame(data)
df

   Year   Name  Age
0  2003    Tom   21
1  2010  Jerry   15
2  2004   John   20
3  2006  Peter   18
4  2005  Linda   19

In [ ]:
pd.DataFrame(data, columns=["Name", "Age", "Year"])

    Name  Age  Year
0    Tom   21  2003
1  Jerry   15  2010
2   John   20  2004
3  Peter   18  2006
4  Linda   19  2005

In [9]:
filename= "student.csv"
df.to_csv(filename, index=False)
print("File Created Successfully")

File Created Successfully

In [12]:
file = pd.read_csv("student.csv")
new_df = pd.DataFrame(file)
new_df

   Year   Name  Age
0  2003    Tom   21
1  2010  Jerry   15
2  2004   John   20
3  2006  Peter   18
4  2005  Linda   19